psas/liblpc23xx/lpc23xx-i2c/lpc23xx-i2c.c

/*
 * lpc23xx-i2c.c
 */

#include <stdint.h>
#include <stdlib.h>

#include "lpc23xx.h"

#include "lpc23xx-binsem.h"
#include "lpc23xx-uart.h"
#include "lpc23xx-util.h"
#include "lpc23xx-vic.h"

#include "lpc23xx-i2c.h"

bin_semaphore         i2c0_binsem_g;
bin_semaphore         i2c1_binsem_g;
bin_semaphore         i2c2_binsem_g;

i2c_master_xact_t     i2c0_s_g;
i2c_master_xact_t     i2c1_s_g;
i2c_master_xact_t     i2c2_s_g;

volatile uint32_t     i2c_wrindex_g;
volatile uint32_t     i2c_rdindex_g;

XACT_FnCallback*      _i2c0_FnCallback_g;
XACT_FnCallback*      _i2c1_FnCallback_g;
XACT_FnCallback*      _i2c2_FnCallback_g;

i2c_master_xact_t*    i2c0_s_caller_g;
i2c_master_xact_t*    i2c1_s_caller_g;
i2c_master_xact_t*    i2c2_s_caller_g;

/*
 * i2c_create_read_addr
 */
uint8_t i2c_create_read_address(uint8_t addr) {
    return (addr << 1) | 0x1;
}

/*
 * i2c_create_write_addr
 */
uint8_t i2c_create_write_address(uint8_t addr) {
    return addr << 1;
}

/*
 * i2c_init_state
 */
void i2c_init_state( i2c_master_xact_t* s) {
    int i = 0;

    s->state             = I2C_IDLE;
    for(i=0; i<I2C_MAX_BUFFER; i++) {
        s->i2c_tx_buffer[i] = 0;
        s->i2c_rd_buffer[i] = 0;
    }
    s->i2c_ext_slave_address = 0x0;
    s->write_length          = 0x0;
    s->read_length           = 0x0;
    s->xact_active           = 0x0;
    s->xact_success          = 0x0;
}

/*
 * I2Cinit
 *
 * 0. Init xaction structure.
 * 1. Turn on the power to the channel
 * 2. Configure the clock for the channel
 * 3. Set I/O pins to correct mode
 * 4. Configure interrupt in VIC
 */
void i2c_init(i2c_iface channel) {

    switch(channel) {
        case I2C0: 
            init_binsem( &i2c0_binsem_g );

            i2c_init_state( &i2c0_s_g );

            POWER_I2C0_ON;

            I2C0CONCLR = 0x7C;
            I2C0CONSET = (I2C_I2EN | I2C_AA); // master mode

            // I2C clock
            I2C0_IS_CCLK_DIV1;
            I2C0SCLL   = I2SCLLOW;
            I2C0SCLH   = I2SCLHIGH;

            I2C0_ENABLE_SDA0_PIN;
            I2C0_ENABLE_SCL0_PIN;

            // pinmode:   I2C0 pins permanent open drain (pullup)
            // reference: lpc23xx usermanual p158 table 107 footnote 2

            // vic
            // set up VIC p93 table 86 lpc23xx user manual
            ENABLE_I2C0_INT;

            VICVectAddr9 = (unsigned int) i2c0_isr;
            VICAddress = 0x0;      // clear VIC address

            I2C0CONCLR   = I2C_SIC;

            break;

        case I2C1: 

            init_binsem(&i2c1_binsem_g);

            i2c_init_state( &i2c1_s_g );

            POWER_I2C1_ON;

            I2C1CONCLR = 0x7C;
            I2C1CONSET = (I2C_I2EN | I2C_AA); // master mode

            I2C2_IS_CCLK_DIV1;
            I2C1SCLL   = I2SCLLOW;
            I2C1SCLH   = I2SCLHIGH;

            I2C1_ENABLE_SDA1_PIN;
            I2C1_ENABLE_SCL1_PIN;

            // reference: lpc23xx usermanual p158 table 107 footnote 2
            I2C1_SDA1_PULLUP;

            // vic
            // set up VIC p93 table 86 lpc23xx user manual
            ENABLE_I2C1_INT;
            VICVectAddr19 = (unsigned int) i2c1_isr;

            I2C1CONCLR    = I2C_SIC;
            break;

        case I2C2: 
            init_binsem(&i2c2_binsem_g);

            i2c_init_state( &i2c2_s_g );

            POWER_I2C2_ON;

            I2C2CONCLR = 0x7C;
            I2C2CONSET = (I2C_I2EN | I2C_AA); // master mode

            // I2C clock
            I2C2_IS_CCLK_DIV1;
            I2C1SCLL   = I2SCLLOW;
            I2C1SCLH   = I2SCLHIGH;

            I2C2_ENABLE_SDA2_PIN;
            I2C2_ENABLE_SCL2_PIN;

            // reference: lpc23xx usermanual p158 table 107 footnote 2
            I2C2_SDA2_PULLUP;

            // vic
            // set up VIC p93 table 86 lpc23xx user manual
            ENABLE_I2C2_INT;
            VICVectAddr30 = (unsigned int) i2c2_isr;

            I2C2CONCLR    = I2C_SIC;
            break;

        default:
            //  error         ???
            break;
    }
}

/*
 * i2c0_isr
 */
void i2c0_isr(void) {

    //   ISR_ENTRY;

    uint32_t                 status;
    uint8_t                  xact_exit;

    xact_exit                = 0;

    status                   = I2C0STAT;

    //Read the I2C state from the correct I2STA register and then branch to
    //the corresponding state routine.
    switch(status) {
        // State 0x00 - Bus Error
        case 0x00:
#ifdef DEBUG_I2C 
            uart0_putstring("*Dbg* I2C state 0x00\n");
#endif
            i2c_wrindex_g     = 0;
            i2c_rdindex_g     = 0;
            i2c0_s_g.state    = I2C_ERROR;
            I2C0CONSET        = (I2C_STO | I2C_AA);
            xact_exit         = 1;
            break;

            // State 0X08 - 
            //   A start condition has been transmitted. 
            //   The Slave Address and Read or Write bit will be transmitted.
            //   An ACK bit will be received.
        case 0x08:
#ifdef DEBUG_I2C 
            uart0_putstring("*Dbg* I2C state 0x08\n");
#endif
            i2c_wrindex_g     = 0;

            // write the Slave Address with R/W bit to I2DAT
            I2C0DAT           = i2c0_s_g.i2c_tx_buffer[i2c_wrindex_g++] ;
            i2c0_s_g.state    = I2C_START;

            break;

            // State 0x10 - 
            //   A repeated start condition has been transmitted.
            //   The Slave Address and Read or Write bit will be transmitted.  
            //   An ACK bit will be received
        case 0x10:
#ifdef DEBUG_I2C 
            uart0_putstring("*Dbg* I2C state 0x10\n");
#endif
            i2c_rdindex_g     = 0;

            // Device address + R/W is first after write data in stream
            I2C0DAT           = i2c0_s_g.i2c_tx_buffer[i2c_wrindex_g++] ;
            i2c0_s_g.state    = I2C_RESTART;
            I2C0CONCLR        = I2C_STAC;
            break;

            // State 0x18 - 
            //   Previous state was 0x08 or 0x10.  
            //   Slave Address and Read or Write has been transmitted.
            //   An ACK has been received. 
            //   The first data byte will be transmitted. 
            //   An ACK bit will be received.
        case 0x18:
#ifdef DEBUG_I2C 
            uart0_putstring("*Dbg* I2C state 0x18\n");
#endif
            if(i2c0_s_g.state == I2C_START) {
                I2C0DAT           = i2c0_s_g.i2c_tx_buffer[i2c_wrindex_g++] ;
                I2C0CONSET        = I2C_AA;
                I2C0CONCLR        = I2C_STAC; // undocumented clear start flag
                i2c0_s_g.state    = I2C_ACK;
            }
            break;

