psas/liblpc23xx/lpc23xx-i2c/lpc23xx-i2c.c
            // State 0x20 - 
            //   Slave Address + Write has been transmitted.  
            //   "NOT_ACK" has been received. 
            //   A Stop condition will be transmitted.
        case 0x20:
#ifdef DEBUG_I2C 
            uart0_putstring("*Dbg* I2C state 0x20\n");
#endif
            I2C0CONSET        = (I2C_STO | I2C_AA);
            xact_exit         = 1;
            i2c0_s_g.state    = I2C_NOTACK;
            I2C0CONCLR        = I2C_STAC; // undocumented clear start flag
            status            = I2C0STAT;

            break;

            // State 0x28 - 
            //   Data has been transmitted, ACK has been received. 
            //   If the transmitted data was the last data byte then 
            //   check to see if read length is > 0. (looking for repeated 
            //   start transaction)
        case 0x28:
#ifdef DEBUG_I2C 
            uart0_putstring("*Dbg* I2C state 0x28\n");
#endif
            if(i2c_wrindex_g < i2c0_s_g.write_length) {
                I2C0DAT           = i2c0_s_g.i2c_tx_buffer[i2c_wrindex_g++] ;
                I2C0CONSET        = I2C_AA;
                i2c0_s_g.state    = I2C_ACK;
            } else {
                if (i2c0_s_g.read_length != 0) {
                    I2C0CONSET        = I2C_STA;  // repeated start
                    i2c0_s_g.state    = I2C_REPEATED_START;
                } else {
                    I2C0CONSET        = (I2C_STO | I2C_AA);
                    xact_exit         = 1;
                    i2c0_s_g.state    = I2C_ACK;
                }
            }
            break;

            // State 0x30 - 
            //   Data has been transmitted, 
            //   NOT ACK received. 
            //   A Stop condition will be transmitted.
        case 0x30:
#ifdef DEBUG_I2C 
            uart0_putstring("*Dbg* I2C state 0x30\n");
#endif
            I2C0CONSET        = (I2C_STO | I2C_AA);
            xact_exit         = 1;
            i2c0_s_g.state    = I2C_NOTACK;
            break;

            // State 0x38 - Multiple Master State 
            //   Arbitration has been lost during Slave Address + Write or data. 
            //   The bus has been released and not addressed Slave mode is entered. 
            //   A new Start condition will be transmitted when the bus is free again.
            //   *** We will issue a STOP here, since we should never be in Multiple master 
            //   mode for our application ***
        case 0x38:
#ifdef DEBUG_I2C 
            uart0_putstring("*Dbg* I2C state 0x38\n");
#endif
            I2C0CONSET        = (I2C_STO | I2C_AA);
            xact_exit       = 1;
            i2c0_s_g.state    = I2C_ERROR;
            break;

            // MASTER RECEIVE STATES

            // State 0x40 
            //   Previous state was State 0x08 or State 0x10. 
            //   Slave Address + Read has been transmitted, ACK has been received.
        case 0x40:
#ifdef DEBUG_I2C 
            uart0_putstring("*Dbg* I2C state 0x40\n");
#endif
            if (i2c0_s_g.read_length == 1) {
                // go to state 0x58
                I2C0CONCLR        = I2C_AAC;
                I2C0CONCLR        = I2C_STAC; // undocumented clear start flag
            } else {
                // go to state 0x50
                I2C0CONSET        = I2C_AA;
                I2C0CONCLR        = I2C_STAC; // undocumented clear start flag
            }
            break;

            // State 0x48 - 
            //   Slave Address + Read has been transmitted, NOT ACK has been received. 
            //   A Stop condition will be transmitted.
        case 0x48:
#ifdef DEBUG_I2C 
            uart0_putstring("*Dbg* I2C state 0x48\n");
#endif
            I2C0CONSET        = (I2C_STO | I2C_AA);
            xact_exit       = 1;
            i2c0_s_g.state    = I2C_NOTACK;
            break;

            // State 0x50 -
            //   Data has been received, ACK has been returned. 
            //   Data will be read from I2DAT. 
            //   Additional data will be received. 
            //   If this is the last data byte then NOT ACK will be returned, 
            //     otherwise ACK will be returned. 
        case 0x50:
#ifdef DEBUG_I2C 
            uart0_putstring("*Dbg* I2C state 0x50\n");
#endif
            i2c0_s_g.i2c_rd_buffer[i2c_rdindex_g++] = I2C0DAT;  
            if(i2c_rdindex_g < (i2c0_s_g.read_length-1)) {
                I2C0CONSET     = I2C_AA;
                i2c0_s_g.state = I2C_ACK;
            } else { // it's the last byte...
                I2C0CONCLR     = I2C_AAC;
                i2c0_s_g.state = I2C_NOTACK;
            }
            break;

            // State: 0x58 - 
            //   Data has been received, NOT ACK has been returned. 
            //   Data will be read from I2DAT. 
            //   A Stop condition will be transmitted.
        case 0x58:
#ifdef DEBUG_I2C 
            uart0_putstring("*Dbg* I2C state 0x58\n");
#endif
            i2c0_s_g.i2c_rd_buffer[i2c_rdindex_g++] = I2C0DAT;  
            I2C0CONSET                              = (I2C_STO | I2C_AA);
            i2c0_s_g.state                          = I2C_NOTACK;
            xact_exit                               = 1;
            break;

            //   Unimplemented state, treat like state 0x0, bus error
        default:
#ifdef DEBUG_I2C 
            uart0_putstring("*Dbg* I2C state 0xdefault\n");
#endif      
            i2c_wrindex_g     = 0;
            i2c_rdindex_g     = 0;
            i2c0_s_g.state    = I2C_ERROR;
            I2C0CONSET        = (I2C_STO | I2C_AA);
            xact_exit         = 1;
            break;
    }

    if(xact_exit == 1) {  // STOP Bit has been set
        if(i2c0_s_g.state != I2C_ERROR) {
            i2c0_s_g.xact_success = 1;
        }
        i2c0_s_g.xact_active = 0;

        _i2c0_FnCallback_g( i2c0_s_caller_g, &i2c0_s_g );
        i2c_init_state(&i2c0_s_g) ;
        release_binsem(&i2c0_binsem_g);
    }
    I2C0CONCLR = I2C_SIC;

    // p 91 LPC23xx_UM
    VICAddress = 0x0;

    //    ISR_EXIT;

