psas/liblpc23xx/lpc23xx-i2c/lpc23xx-i2c.c
            // State 0x48 - 
            //   Slave Address + Read has been transmitted, NOT ACK has been received. 
            //   A Stop condition will be transmitted.
        case 0x48:
#ifdef DEBUG_I2C 
            uart0_putstring("*Dbg* I2C1 state 0x48\n");
#endif
            I2C1CONSET        = (I2C_STO | I2C_AA);
            xact_exit       = 1;
            i2c1_s_g.state    = I2C_NOTACK;
            break;

            // State 0x50 -
            //   Data has been received, ACK has been returned. 
            //   Data will be read from I2DAT. 
            //   Additional data will be received. 
            //   If this is the last data byte then NOT ACK will be returned, 
            //     otherwise ACK will be returned. 
        case 0x50:
#ifdef DEBUG_I2C 
            uart0_putstring("*Dbg* I2C1 state 0x50\n");
#endif
            i2c1_s_g.i2c_rd_buffer[i2c_rdindex_g++] = I2C1DAT;  
            if(i2c_rdindex_g < (i2c1_s_g.read_length-1)) {
                I2C1CONSET     = I2C_AA;
                i2c1_s_g.state = I2C_ACK;
            } else { // it's the last byte...
                I2C1CONCLR     = I2C_AAC;
                i2c1_s_g.state = I2C_NOTACK;
            }
            break;

            // State: 0x58 - 
            //   Data has been received, NOT ACK has been returned. 
            //   Data will be read from I2DAT. 
            //   A Stop condition will be transmitted.
        case 0x58:
#ifdef DEBUG_I2C 
            uart0_putstring("*Dbg* I2C1 state 0x58\n");
#endif
            i2c1_s_g.i2c_rd_buffer[i2c_rdindex_g++] = I2C1DAT;  
            I2C1CONSET                              = (I2C_STO | I2C_AA);
            i2c1_s_g.state                          = I2C_NOTACK;
            xact_exit                               = 1;
            break;

            //   Unimplemented state, treat like state 0x0, bus error
        default:
#ifdef DEBUG_I2C 
            uart0_putstring("*Dbg* I2C1 state 0xdefault\n");
#endif      
            i2c_wrindex_g     = 0;
            i2c_rdindex_g     = 0;
            i2c1_s_g.state    = I2C_ERROR;
            I2C1CONSET        = (I2C_STO | I2C_AA);
            xact_exit         = 1;
            break;
    }

    if(xact_exit == 1) {  // STOP Bit has been set
        if(i2c1_s_g.state != I2C_ERROR) {
            i2c1_s_g.xact_success = 1;
        }
        i2c1_s_g.xact_active = 0;

        _i2c1_FnCallback_g( i2c1_s_caller_g, &i2c1_s_g );
        i2c_init_state(&i2c1_s_g) ;
        release_binsem(&i2c1_binsem_g);
    }
    I2C1CONCLR = I2C_SIC;

    // p 91 LPC23xx_UM
    VICAddress = 0x0;

    //    ISR_EXIT;

}

/*
 * i2c2_isr
 */
void i2c2_isr(void) {

    //   ISR_ENTRY;

    uint32_t                 status;
    uint8_t                  xact_exit;

    xact_exit                = 0;

    status                   = I2C2STAT;

    //Read the I2C state from the correct I2STA register and then branch to
    //the corresponding state routine.
    switch(status) {
        // State 0x00 - Bus Error
        case 0x00:
#ifdef DEBUG_I2C 
            uart0_putstring("*Dbg* I2C state 0x00\n");
#endif
            i2c_wrindex_g     = 0;
            i2c_rdindex_g     = 0;
            i2c2_s_g.state    = I2C_ERROR;
            I2C2CONSET        = (I2C_STO | I2C_AA);
            xact_exit         = 1;
            break;

            // State 0X08 - 
            //   A start condition has been transmitted. 
            //   The Slave Address and Read or Write bit will be transmitted.
            //   An ACK bit will be received.
        case 0x08:
#ifdef DEBUG_I2C 
            uart0_putstring("*Dbg* I2C state 0x08\n");
#endif
            i2c_wrindex_g     = 0;

            // write the Slave Address with R/W bit to I2DAT
            I2C2DAT           = i2c2_s_g.i2c_tx_buffer[i2c_wrindex_g++] ;
            i2c2_s_g.state    = I2C_START;

            break;

            // State 0x10 - 
            //   A repeated start condition has been transmitted.
            //   The Slave Address and Read or Write bit will be transmitted.  
            //   An ACK bit will be received
        case 0x10:
#ifdef DEBUG_I2C 
            uart0_putstring("*Dbg* I2C state 0x10\n");
#endif
            i2c_rdindex_g     = 0;

            // Device address + R/W is first after write data in stream
            I2C2DAT           = i2c2_s_g.i2c_tx_buffer[i2c_wrindex_g++] ;
            i2c2_s_g.state    = I2C_RESTART;
            I2C2CONCLR        = I2C_STAC;
            break;

            // State 0x18 - 
            //   Previous state was 0x08 or 0x10.  
            //   Slave Address and Read or Write has been transmitted.
            //   An ACK has been received. 
            //   The first data byte will be transmitted. 
            //   An ACK bit will be received.
        case 0x18:
#ifdef DEBUG_I2C 
            uart0_putstring("*Dbg* I2C state 0x18\n");
#endif
            if(i2c2_s_g.state == I2C_START) {
                I2C2DAT           = i2c2_s_g.i2c_tx_buffer[i2c_wrindex_g++] ;
                I2C2CONSET        = I2C_AA;
                I2C2CONCLR        = I2C_STAC; // undocumented clear start flag
                i2c2_s_g.state    = I2C_ACK;
            }
            break;

            // State 0x20 - 
            //   Slave Address + Write has been transmitted.  
            //   "NOT_ACK" has been received. 
            //   A Stop condition will be transmitted.
        case 0x20:
#ifdef DEBUG_I2C 
            uart0_putstring("*Dbg* I2C state 0x20\n");
#endif
            I2C2CONSET        = (I2C_STO | I2C_AA);
            xact_exit         = 1;
            i2c2_s_g.state    = I2C_NOTACK;
            I2C2CONCLR        = I2C_STAC; // undocumented clear start flag
            status            = I2C2STAT;

            break;

            // State 0x28 - 
            //   Data has been transmitted, ACK has been received. 
            //   If the transmitted data was the last data byte then 
            //   check to see if read length is > 0. (looking for repeated 
            //   start transaction)
        case 0x28:
#ifdef DEBUG_I2C 
            uart0_putstring("*Dbg* I2C state 0x28\n");
#endif
            if(i2c_wrindex_g < i2c2_s_g.write_length) {
                I2C2DAT           = i2c2_s_g.i2c_tx_buffer[i2c_wrindex_g++] ;
                I2C2CONSET        = I2C_AA;
                i2c2_s_g.state    = I2C_ACK;
            } else {
                if (i2c2_s_g.read_length != 0) {
                    I2C2CONSET        = I2C_STA;  // repeated start
                    i2c2_s_g.state    = I2C_REPEATED_START;
                } else {
                    I2C2CONSET        = (I2C_STO | I2C_AA);
                    xact_exit         = 1;
                    i2c2_s_g.state    = I2C_ACK;
                }
            }
            break;

            // State 0x30 - 
            //   Data has been transmitted, 
            //   NOT ACK received. 
            //   A Stop condition will be transmitted.
        case 0x30:
#ifdef DEBUG_I2C 
            uart0_putstring("*Dbg* I2C state 0x30\n");
#endif
            I2C2CONSET        = (I2C_STO | I2C_AA);
            xact_exit         = 1;
            i2c2_s_g.state    = I2C_NOTACK;
            break;

            // State 0x38 - Multiple Master State 
            //   Arbitration has been lost during Slave Address + Write or data. 
            //   The bus has been released and not addressed Slave mode is entered. 
            //   A new Start condition will be transmitted when the bus is free again.
            //   *** We will issue a STOP here, since we should never be in Multiple master 
            //   mode for our application ***
        case 0x38:
#ifdef DEBUG_I2C 
            uart0_putstring("*Dbg* I2C state 0x38\n");
#endif
            I2C2CONSET        = (I2C_STO | I2C_AA);
            xact_exit       = 1;
            i2c2_s_g.state    = I2C_ERROR;
            break;

