psas/liblpc23xx/lpc23xx-i2c/lpc23xx-i2c.c
            // MASTER RECEIVE STATES

            // State 0x40 
            //   Previous state was State 0x08 or State 0x10. 
            //   Slave Address + Read has been transmitted, ACK has been received.
        case 0x40:
#ifdef DEBUG_I2C 
            uart0_putstring("*Dbg* I2C state 0x40\n");
#endif
            if (i2c2_s_g.read_length == 1) {
                // go to state 0x58
                I2C2CONCLR        = I2C_AAC;
                I2C2CONCLR        = I2C_STAC; // undocumented clear start flag
            } else {
                // go to state 0x50
                I2C2CONSET        = I2C_AA;
                I2C2CONCLR        = I2C_STAC; // undocumented clear start flag
            }
            break;

            // State 0x48 - 
            //   Slave Address + Read has been transmitted, NOT ACK has been received. 
            //   A Stop condition will be transmitted.
        case 0x48:
#ifdef DEBUG_I2C 
            uart0_putstring("*Dbg* I2C state 0x48\n");
#endif
            I2C2CONSET        = (I2C_STO | I2C_AA);
            xact_exit       = 1;
            i2c2_s_g.state    = I2C_NOTACK;
            break;

            // State 0x50 -
            //   Data has been received, ACK has been returned. 
            //   Data will be read from I2DAT. 
            //   Additional data will be received. 
            //   If this is the last data byte then NOT ACK will be returned, 
            //     otherwise ACK will be returned. 
        case 0x50:
#ifdef DEBUG_I2C 
            uart0_putstring("*Dbg* I2C state 0x50\n");
#endif
            i2c2_s_g.i2c_rd_buffer[i2c_rdindex_g++] = I2C2DAT;  
            if(i2c_rdindex_g < (i2c2_s_g.read_length-1)) {
                I2C2CONSET     = I2C_AA;
                i2c2_s_g.state = I2C_ACK;
            } else { // it's the last byte...
                I2C2CONCLR     = I2C_AAC;
                i2c2_s_g.state = I2C_NOTACK;
            }
            break;

            // State: 0x58 - 
            //   Data has been received, NOT ACK has been returned. 
            //   Data will be read from I2DAT. 
            //   A Stop condition will be transmitted.
        case 0x58:
#ifdef DEBUG_I2C 
            uart0_putstring("*Dbg* I2C state 0x58\n");
#endif
            i2c2_s_g.i2c_rd_buffer[i2c_rdindex_g++] = I2C2DAT;  
            I2C2CONSET                              = (I2C_STO | I2C_AA);
            i2c2_s_g.state                          = I2C_NOTACK;
            xact_exit                               = 1;
            break;

            //   Unimplemented state, treat like state 0x0, bus error
        default:
#ifdef DEBUG_I2C 
            uart0_putstring("*Dbg* I2C state 0xdefault\n");
#endif      
            i2c_wrindex_g     = 0;
            i2c_rdindex_g     = 0;
            i2c2_s_g.state    = I2C_ERROR;
            I2C2CONSET        = (I2C_STO | I2C_AA);
            xact_exit         = 1;
            break;
    }

    if(xact_exit == 1) {  // STOP Bit has been set
        if(i2c2_s_g.state != I2C_ERROR) {
            i2c2_s_g.xact_success = 1;
        }
        i2c2_s_g.xact_active = 0;

        _i2c2_FnCallback_g( i2c2_s_caller_g, &i2c2_s_g );
        i2c_init_state(&i2c2_s_g) ;
        release_binsem(&i2c2_binsem_g);
    }
    I2C2CONCLR = I2C_SIC;

    // p 91 LPC23xx_UM
    VICAddress = 0x0;

    //    ISR_EXIT;

}


/*****************************************************************************
// EXAMPLE BASIC CALLBACK FUNCTION
void app_i2c0_callback(i2c_master_xact_t* caller, i2c_master_xact_t* i2c) {
    uint16_t i;
    for(i=0; i<I2C_MAX_BUFFER; ++i) {
        caller->i2c_tx_buffer[i] = i2c->i2c_tx_buffer[i];
        caller->i2c_rd_buffer[i] = i2c->i2c_rd_buffer[i];
    }

    caller->i2cext_slave_address = i2c->i2cext_slave_address;
    caller->write_length         = i2c->write_length;
    caller->read_length          = i2c->read_length;
    caller->xact_active          = i2c->xact_active;
    caller->xact_success         = i2c->xact_success;
    // maybe trigger an interrupt here
}

 ****************************************************************************/

/*
 * start_i2c0_master_xact
 * Input: Pointer to i2c_master_t structure with xaction data
 */
void start_i2c0_master_xact(i2c_master_xact_t* s, XACT_FnCallback* xact_fn) {


    uint16_t i;
    if(s!=NULL) {
        // See if we can obtain the semaphore. If the semaphore is not available 
        // wait I2C_BINSEM_WAIT msecs to see if it becomes free. 
        if( get_binsem( &i2c0_binsem_g, I2C_BINSEM_WAITTICKS ) == 1 ) {  // binsem for channel 0
            for(i=0; i<I2C_MAX_BUFFER; ++i) {
                i2c0_s_g.i2c_tx_buffer[i]  = s->i2c_tx_buffer[i];
                i2c0_s_g.i2c_rd_buffer[i]  = s->i2c_rd_buffer[i];
            }
            i2c0_s_g.i2c_ext_slave_address = s->i2c_ext_slave_address;
            i2c0_s_g.write_length          = s->write_length;
            i2c0_s_g.read_length           = s->read_length;
            i2c0_s_g.xact_active           = 1;
            i2c0_s_g.xact_success          = 0;
            s->xact_active                 = 1;
            s->xact_success                = 0;
            i2c0_s_caller_g                = s;
            _i2c0_FnCallback_g             = xact_fn;

            //write 0x20 to I2CONSET to set the STA bit
            I2C0CONSET                    = I2C_STA;
        } else { 
            uart0_putstring("*** I2C0-ERROR ***: I2C0_master_xact, Timed out waiting for i2c0_binsem_g. Skipping Request.\n");
        } 
    } else {
        uart0_putstring("*** I2C0-ERROR ***: I2C0_master_xact, structure pointer is NULL. Skipping.\n");
    }
}

/*
 * start_i2c1_master_xact
 * Input: Pointer to i2c_master_t structure with xaction data
 */
void start_i2c1_master_xact(i2c_master_xact_t* s, XACT_FnCallback* xact_fn) {


    uint16_t i;
    if(s!=NULL) {
        // See if we can obtain the semaphore. If the semaphore is not available 
        // wait I2C_BINSEM_WAIT msecs to see if it becomes free. 
        if( get_binsem( &i2c1_binsem_g, I2C_BINSEM_WAITTICKS ) == 1 ) {  // binsem for channel 0
            for(i=0; i<I2C_MAX_BUFFER; ++i) {
                i2c1_s_g.i2c_tx_buffer[i]  = s->i2c_tx_buffer[i];
                i2c1_s_g.i2c_rd_buffer[i]  = s->i2c_rd_buffer[i];
            }
            i2c1_s_g.i2c_ext_slave_address = s->i2c_ext_slave_address;
            i2c1_s_g.write_length          = s->write_length;
            i2c1_s_g.read_length           = s->read_length;
            i2c1_s_g.xact_active           = 1;
            i2c1_s_g.xact_success          = 0;
            s->xact_active                 = 1;
            s->xact_success                = 0;
            i2c1_s_caller_g                = s;
            _i2c1_FnCallback_g             = xact_fn;

            //write 0x20 to I2CONSET to set the STA bit
            I2C1CONSET                    = I2C_STA;
        } else { 
            uart0_putstring("*** i2c1-ERROR ***: i2c1_master_xact, Timed out waiting for i2c1_binsem_g. Skipping Request.\n");
        } 
    } else {
        uart0_putstring("*** i2c1-ERROR ***: i2c1_master_xact, structure pointer is NULL. Skipping.\n");
    }
}

