psas/liblpc23xx/lpc23xx-i2c/lpc23xx-i2c.c
/*
 * start_i2c2_master_xact
 * Input: Pointer to i2c_master_t structure with xaction data
 */
void start_i2c2_master_xact(i2c_master_xact_t* s, XACT_FnCallback* xact_fn) {


    uint16_t i;
    if(s!=NULL) {
        // See if we can obtain the semaphore. If the semaphore is not available 
        // wait I2C_BINSEM_WAIT msecs to see if it becomes free. 
        if( get_binsem( &i2c2_binsem_g, I2C_BINSEM_WAITTICKS ) == 1 ) {  // binsem for channel 0
            for(i=0; i<I2C_MAX_BUFFER; ++i) {
                i2c2_s_g.i2c_tx_buffer[i]  = s->i2c_tx_buffer[i];
                i2c2_s_g.i2c_rd_buffer[i]  = s->i2c_rd_buffer[i];
            }
            i2c2_s_g.i2c_ext_slave_address = s->i2c_ext_slave_address;
            i2c2_s_g.write_length          = s->write_length;
            i2c2_s_g.read_length           = s->read_length;
            i2c2_s_g.xact_active           = 1;
            i2c2_s_g.xact_success          = 0;
            s->xact_active                 = 1;
            s->xact_success                = 0;
            i2c2_s_caller_g                = s;
            _i2c2_FnCallback_g             = xact_fn;

            //write 0x20 to I2CONSET to set the STA bit
            I2C2CONSET                    = I2C_STA;
        } else { 
            uart0_putstring("*** i2c2-ERROR ***: i2c2_master_xact, Timed out waiting for i2c2_binsem_g. Skipping Request.\n");
        } 
    } else {
        uart0_putstring("*** i2c2-ERROR ***: i2c2_master_xact, structure pointer is NULL. Skipping.\n");
    }
}

